import { heavyCalc } from "../utils";

// Цей код є реалізацією Web Worker, який виконує важку обчислювальну задачу для великої кількості елементів.
// Воркер отримує повідомлення з кількістю елементів для обробки, виконує обчислення і надсилає прогрес і результат назад у головний потік.

// Важливо відзначити, що код воркера виконується в окремому потоці, тому він не блокує UI і дозволяє інтерфейсу залишатися чуйним під час виконання важкої задачі.
self.onmessage = ({ data }: MessageEvent<{ items: number }>) => {
  const startedAt = performance.now(); // Запускаємо таймер для вимірювання часу виконання задачі

  // Виконуємо важку задачу для кожного елемента.
  // В процесі виконання періодично надсилаємо повідомлення з прогресом назад у головний потік.
  for (let i = 0; i < data.items; i += 1) {
    heavyCalc(i);

    // Оновлюємо прогрес, надсилаючи повідомлення назад у головний потік.
    // Це дозволяє головному потоку отримувати оновлення про прогрес виконання задачі і, наприклад, оновлювати інтерфейс користувача.
    if (i % 10000 === 0) {
      self.postMessage({
        progress: Math.round((i / data.items) * 100), // Обчислюємо прогрес у відсотках
        done: false, // Вказуємо, що задача ще не завершена
      });
    }
  }

  const endedAt = performance.now(); // Зупиняємо таймер після завершення задачі

  // Надсилаємо фінальне повідомлення з результатом виконання задачі, включаючи загальний час виконання.
  self.postMessage({
    progress: 100,
    done: true,
    durationMs: endedAt - startedAt,
  });
};
