// Ця функція створює обгортку для будь-якої функції, яка буде викликатися в режимі requestAnimationFrame (RAF)
// Вона гарантує, що функція буде викликана не більше одного разу за кадр (не більше 60 разів на секунду),
// - це головна різниця між просто RAF та rafThrottle, яка дозволяє обмежити кількість викликів функції до одного разу за кадр,
// навіть якщо її викликають частіше, що може покращити продуктивність при обробці частих подій, таких як scroll або mousemove.

export default function rafThrottle<TArgs extends ReadonlyArray<unknown>>(
  fn: (...args: TArgs) => void,
): (...args: TArgs) => void {
  let scheduled = false; // Це прапорець, який показує, чи вже заплановано виклик функції в RAF
  let lastArgs: TArgs | null = null; // Це змінна, в якій зберігаються останні аргументи, з якими була викликана обгортка

  // Повертаємо нову функцію, яка буде обгорткою для fn
  return (...args: TArgs) => {
    lastArgs = args; // Кожного разу, коли обгортка викликається, ми зберігаємо її аргументи в lastArgs

    // Якщо вже заплановано виклик в RAF, то нічого не робимо, просто оновлюємо lastArgs
    if (scheduled) {
      return;
    }

    // Якщо виклик ще не заплановано, то заплануємо його

    scheduled = true; // Встановлюємо прапорець, що виклик заплановано

    // Використовуємо requestAnimationFrame, щоб викликати функцію fn з останніми аргументами в наступному кадрі
    requestAnimationFrame(() => {
      scheduled = false; // Скидаємо прапорець, що виклик заплановано, щоб можна було запланувати наступний виклик
      const a = lastArgs; // Зберігаємо lastArgs в локальну змінну, щоб викликати fn з цими аргументами
      lastArgs = null; // Очищаємо lastArgs, щоб не зберігати зайві дані в пам'яті

      // Якщо a не null, то викликаємо fn з аргументами a
      if (a) {
        fn(...a);
      }
    });
  };
}

// requestAnimationFrame — це API браузера, яке дозволяє виконати функцію перед наступним кадром малювання сторінки
// Як браузер малює сторінку
// 1. Браузер отримує сигнал, що потрібно оновити сторінку (наприклад, через scroll, resize, mousemove, setState тощо)
// 2. Браузер виконує всі обробники подій, які були викликані цим сигналом (наприклад, всі onScroll, onResize, onMouseMove тощо)
// 3. Якщо в цих обробниках була викликана функція, яка була обгорнута в rafThrottle, то вона запланує свій виклик в requestAnimationFrame
// 4. Після того, як всі обробники подій виконані, браузер виконує всі функції, які були заплановані в requestAnimationFrame (наприклад, ті, що були обгорнуті в rafThrottle)
// 5. Браузер малює сторінку з урахуванням всіх змін, які були зроблені в цих функціях
// Таким чином, rafThrottle дозволяє обмежити кількість викликів функції до одного разу за кадр, навіть якщо її викликають частіше, що може покращити продуктивність при обробці частих подій, таких як scroll або mousemove.
