import type { Order } from "@/shared/types/order";

// Це навмисно важка функція, яку ми будемо використовувати для demo memoization
// Вона імітує складні обчислення, які можуть бути пов'язані з обробкою замовлень
// Використання Math.sqrt та циклів робить її досить повільною, що дозволяє нам побачити переваги memoization
export default function bigSumWork(orders: ReadonlyArray<Order>): number {
  let total = 0; // Ініціалізуємо змінну для зберігання загальної суми

  // Проходимо через 12 "проходів", що імітують складні обчислення
  for (let pass = 0; pass < 12; pass += 1) {
    for (const o of orders) {
      // Для кожного замовлення додаємо до total квадратний корінь від суми кількості та суми замовлення, помножений на 0.33
      // sqrt - це повільна операція, яка робить цю функцію важкою для обчислення, особливо при великій кількості замовлень
      // Це квадратний корінь від суми кількості та суми замовлення, помножений на 0.33, що є просто прикладом складного обчислення, яке може бути пов'язане з обробкою замовлень
      total += Math.sqrt(o.amount * (pass + 1)) * 0.33;
    }
  }
  return total;
}
