import { EventMap, TypedEmitter } from "../types";

// Функція createTypedEmitter створює типізований еммітер подій,
// який дозволяє підписуватися на події та викликати їх з типізованими даними.
export function createTypedEmitter<
  TEvents extends EventMap,
>(): TypedEmitter<TEvents> {
  // Використовуємо Map для зберігання набору обробників для кожного типу події.
  // Ключами є назви подій, а значеннями є множини (Set) обробників, які підписані на ці події.
  const listeners = new Map<keyof TEvents, Set<(payload: any) => void>>();

  // Метод on дозволяє підписатися на певну подію з відповідним обробником.
  // Він приймає назву події та функцію-обробник, яка буде викликана з даними, коли ця подія буде викликана.
  function on<K extends keyof TEvents>(
    event: K,
    handler: (payload: TEvents[K]) => void,
  ) {
    const set = listeners.get(event) ?? new Set(); // Отримуємо поточний набір обробників для цієї події або створюємо новий, якщо його ще немає
    set.add(handler); // Додаємо обробник до набору обробників для цієї події
    listeners.set(event, set); // Зберігаємо оновлений набір обробників для цієї події в Map

    return () => {
      // Повертаємо функцію для відписки від події, яка видаляє обробник з набору обробників для цієї події
      const current = listeners.get(event);

      // Якщо поточного набору обробників для цієї події немає, просто повертаємося, оскільки немає чого видаляти
      if (!current) {
        return;
      }
      current.delete(handler); // Видаляємо обробник з набору обробників для цієї події, що дозволяє відписатися від події
    };
  }

  // Метод emit дозволяє викликати певну подію з відповідними даними.
  // Він приймає назву події та дані, які будуть передані всім обробникам, підписаним на цю подію.
  function emit<K extends keyof TEvents>(event: K, payload: TEvents[K]) {
    const set = listeners.get(event); // Отримуємо набір обробників для цієї події

    // Якщо немає обробників для цієї події, просто повертаємося, оскільки немає кому викликати обробник
    if (!set) {
      return;
    }

    // Викликаємо кожен обробник, підписаний на цю подію, передаючи їм дані (payload) цієї події
    for (const handler of set) {
      handler(payload);
    }
  }

  // Повертаємо об’єкт з методами on та emit, який відповідає типу TypedEmitter<TEvents>,
  // що дозволяє використовувати цей еммітер для підписки на події та їх виклику з типізованими даними
  return { on, emit };
}
